package main

/*
Написать программу, которая конкурентно рассчитает значение квадратов чисел взятых из массива (2,4,6,8,10) и выведет их квадраты в stdout.
*/
import (
	"fmt"
	"sync"
)

func main() {
	var wg sync.WaitGroup // Объявляем переменную wg как WaitGroup для управления синхронизацией между горутинами

	arr := []int{2, 4, 6, 8, 10}

	// Итерация по массиву для запуска горутины для каждого элемента
	for _, i := range arr {
		wg.Add(1) // Для каждой итерации увеличиваем счетчик WaitGroup на 1 перед запуском горутины

		// Запуск анонимной горутины с передачей текущего значения i как параметра
		go func(i int) {
			defer wg.Done()    // После выполнения горутины, уменьшаем счетчик WaitGroup на 1
			fmt.Println(i * i) // Выводим квадрат текущего числа
		}(i) // Здесь в грутину передается значение из массива arr
	}

	wg.Wait() // Блокировка выполнения главной горутины до тех пор, пока все горутины не отработают и счетчик WaitGroup не станет равен 0
}
