package main

/*
Дана последовательность чисел: 2,4,6,8,10. Найти сумму их квадратов(22+32+42….) с использованием конкурентных вычислений.
*/
import (
	"fmt"
	"sync"
	"time"
)

func main() {
	start := time.Now() // Запоминаем время начала выполнения

	var wg sync.WaitGroup   // Группа ожидания для синхронизации горутин
	result := 0             // Переменная для результата
	arr := make([]int, 1e6) // Создание массива из 1 миллиона элементов

	for i := range arr {
		wg.Add(1) // Добавление счетчика для каждой горутины

		go func(i *int) { // Запуск горутины, передаем указатель на элемент массива
			defer wg.Done() // Уменьшение счетчика при завершении горутины
			*i = *i * *i    // Вычисление квадрата элемента по указателю
		}(&arr[i]) // Передаем адрес элемента массива
	}

	wg.Wait() // Ожидание завершения всех горутин

	for _, val := range arr {
		result += val // Суммирование всех элементов массива
	}
	fmt.Println(result)                                          // Вывод суммы
	elapsed := time.Since(start)                                 // Вычисление времени выполнения
	fmt.Printf("Execution time: %d ns\n", elapsed.Nanoseconds()) // Вывод времени выполнения в наносекундах
}
