package main

/*
Разработать программу, которая перемножает, делит, складывает, вычитает две числовых переменных a,b, значение которых > 2^20.
*/

import (
	"fmt"
)

func main() {
	// Определение переменных a и b
	a := 1 << 21 // 2^21, что больше 2^20
	b := 1 << 22 // 2^22, что также больше 2^20

	// Выполнение арифметических операций
	sum := a + b        // Сложение
	difference := a - b // Вычитание
	product := a * b    // Умножение
	quotient := a / b   // Деление

	// Вывод результатов
	fmt.Printf("Сложение: %d + %d = %d\n", a, b, sum)
	fmt.Printf("Вычитание: %d - %d = %d\n", a, b, difference)
	fmt.Printf("Умножение: %d * %d = %d\n", a, b, product)
	fmt.Printf("Деление: %d / %d = %d\n", a, b, quotient)
}
