package main

/*
Разработать программу, которая переворачивает слова в строке.
Пример: «snow dog sun — sun dog snow».
*/
import (
	"fmt"
	"strings"
)

func main() {
	str := "snow dog sun" // Исходная строка.

	// Разбиваем строку на слова и сохраняем их в срез arr.
	arr := strings.Fields(str)

	// Обратное инвертирование элементов среза arr.
	// Мы используем два индекса, один идет с начала, а другой с конца среза, и меняем слова местами.
	for i, j := 0, len(arr)-1; i < j; i, j = i+1, j-1 {
		arr[i], arr[j] = arr[j], arr[i] // Меняем местами слова.
	}

	// Соединяем слова обратно в строку с пробелами между ними.
	str = strings.Join(arr, " ")

	fmt.Println(str) // Выводим результат, который представляет собой обратную строку из слов.
}
